import Contact from '../Contact/Contact.jsx'
import style from './Contacts.module.scss'

export default function Contacts() {
    const myTg = 'https://t.me/Mohatma';
    const myMail = 'mailto:het.dar2003@yandex.ru?subject=Хотелось бы с вами связаться t&body= Здравствуйте!';
    const myGitHub = 'https://github.com/hetagdarchiev';
    return (
        <section id={'contacts'} className={`${style.contacts} container`}>
            <h2>
                Contacts
            </h2>
            <div className={style.contacts__wrapper}>
                <Contact title={'Telegram'} link={myTg}>
                    <svg width="800px" height="800px" viewBox="0 0 24 24" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                              d="M23.1117 4.49449C23.4296 2.94472 21.9074 1.65683 20.4317 2.227L2.3425 9.21601C0.694517 9.85273 0.621087 12.1572 2.22518 12.8975L6.1645 14.7157L8.03849 21.2746C8.13583 21.6153 8.40618 21.8791 8.74917 21.968C9.09216 22.0568 9.45658 21.9576 9.70712 21.707L12.5938 18.8203L16.6375 21.8531C17.8113 22.7334 19.5019 22.0922 19.7967 20.6549L23.1117 4.49449ZM3.0633 11.0816L21.1525 4.0926L17.8375 20.2531L13.1 16.6999C12.7019 16.4013 12.1448 16.4409 11.7929 16.7928L10.5565 18.0292L10.928 15.9861L18.2071 8.70703C18.5614 8.35278 18.5988 7.79106 18.2947 7.39293C17.9906 6.99479 17.4389 6.88312 17.0039 7.13168L6.95124 12.876L3.0633 11.0816ZM8.17695 14.4791L8.78333 16.6015L9.01614 15.321C9.05253 15.1209 9.14908 14.9366 9.29291 14.7928L11.5128 12.573L8.17695 14.4791Z"
                              fill=""/>
                    </svg>
                </Contact>
                <Contact title={'Email'} link={myMail}>
                    <svg fill="#66fcf1" width="800px" height="800px" viewBox="0 0 1920 1920"
                         xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M0 1694.235h1920V226H0v1468.235ZM112.941 376.664V338.94H1807.06v37.723L960 1111.233l-847.059-734.57ZM1807.06 526.198v950.513l-351.134-438.89-88.32 70.475 378.353 472.998H174.042l378.353-472.998-88.32-70.475-351.134 438.89V526.198L960 1260.768l847.059-734.57Z"
                            fill-rule="evenodd"/>
                    </svg>
                </Contact>
                <Contact title={'GitHub'} link={myGitHub}>
                    <svg width="800px" height="800px" viewBox="0 0 48 48" id="Layer_2" data-name="Layer 2"
                         xmlns="http://www.w3.org/2000/svg">
                        <path className="cls-1"
                              d="M24,2.5a21.5,21.5,0,0,0-6.8,41.9c1.08.2,1.47-.46,1.47-1s0-1.86,0-3.65c-6,1.3-7.24-2.88-7.24-2.88A5.7,5.7,0,0,0,9,33.68c-1.95-1.33.15-1.31.15-1.31a4.52,4.52,0,0,1,3.29,2.22c1.92,3.29,5,2.34,6.26,1.79a4.61,4.61,0,0,1,1.37-2.88c-4.78-.54-9.8-2.38-9.8-10.62a8.29,8.29,0,0,1,2.22-5.77,7.68,7.68,0,0,1,.21-5.69s1.8-.58,5.91,2.2a20.46,20.46,0,0,1,10.76,0c4.11-2.78,5.91-2.2,5.91-2.2a7.74,7.74,0,0,1,.21,5.69,8.28,8.28,0,0,1,2.21,5.77c0,8.26-5,10.07-9.81,10.61a5.12,5.12,0,0,1,1.46,4c0,2.87,0,5.19,0,5.9s.39,1.24,1.48,1A21.5,21.5,0,0,0,24,2.5"/>
                    </svg>
                </Contact>
            </div>
        </section>
    )
}